Revit 2024 API
IFCImportIntent Enumeration
 The intent of the IFC import.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public enum IFCImportIntent
Visual Basic
Public Enumeration IFCImportIntent
Visual C++
public enum class IFCImportIntent
Members
Member name | Description
Parametric |  Imports the IFC file to allow for continued editing in Revit (standard Revit elements will be created).
Reference |  Imports the IFC file to serve as a reference (lightweight and accurate representations will be constructed, but they cannot be edited as standard Revit elements).
See Also
Autodesk.Revit.DB.IFC Namespace